packages/benchmarking/src/loadtests/artillery/huge.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: "{{ $processEnvironment.STREAMERSON_GATEWAY_HOST }}"
  phases:
    - duration: 15
      arrivalRate: 10
      rampTo: 100
      name: Warm up phase
    - duration: 45
      arrivalRate: 100
      rampTo: 200
      name: Ramp up load
    - duration: 30
      arrivalRate: 250
      rampTo: 300
      name: Spike phase
scenarios:
  - flow:
      - loop:
          - get:
              url: "/bench"
        count: 100